app/Controllers/Catalogo.php

SELECT *
FROM `catalogo`
---
    public function index()
    {
        $model = new CatalogoModel();
        $data['productos'] = $model->findAll();

INSERT INTO `catalogo` (`nombre`, `descripcion`, `precio`) VALUES ('coca cola', '500ml', '500')
---
    public function crear()
    {
        helper(['form']);
        $validation = \Config\Services::validation();

        $validation->setRules([
            'nombre'      => 'required',
            'descripcion' => 'required',
            'precio'      => 'required|decimal',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return view('catalogo/formulario', [
                'validation' => $validation,
            ]);
        }

        $model = new CatalogoModel();

        $data = [
            'nombre'      => $this->request->getPost('nombre'),
            'descripcion' => $this->request->getPost('descripcion'),
            'precio'      => $this->request->getPost('precio'),
        ];

        $model->insert($data);

DELETE FROM `catalogo`
WHERE `id` IN ('2')
---
    public function eliminar($id)
    {
        $model = new CatalogoModel();
        $model->delete($id);

SELECT *
FROM `catalogo`
WHERE `catalogo`.`id` = '2'
---
    public function editar($id)
{
    $model = new \App\Models\CatalogoModel();
    $producto = $model->find($id);